package by.jrr.serpolak;

public class Obj {
    public static void main(String[] args) {
        System.out.println("1 - Локомотив\n" +
                "Cостояние: \n"+
                        " грузовой\n" +
                        " пассажирский\n" +
                        "кол-во прицепных вагонов\n" +
                        "Поведение :\n" +
                        "прицеплять вагоны\n" +
                        "везти вагоны от точки А до т.Б\n" +
                        "стоять на станции, ремонте, обслуживании");
        System.out.println();
        System.out.println("2 - Работник\n" +
                "Состояние :\n" +
                " профессия \n" +
                "квалификация \n" +
                "уровень зарплаты \n" +
                "Поведение : \n" +
                "работает \n" +
                "отдыхает(выходные) \n" +
                "перерыв на обед ");
        System.out.println();
        System.out.println("3 - велосипед \n" +
                "Состояние : \n" +
                "детский \n" +
                "взрослый \n" +
                " 2-х колесный \n" +
                "4-х колесный \n" +
                "Поведение : \n" +
                "едет \n" +
                "не едит");
        System.out.println();
        System.out.println("4 - Книга \n" +
                "Состояние :\n" +
                "количество страниц \n" +
                "открыть/Закрыть \n" +
                "Поведение : \n" +
                "читать \n" +
                "открыть/Закрыть");
        System.out.println();
        System.out.println("5 - Замок \n" +
                "Состояние : \n" +
                "накладной \n" +
                "врезной \n" +
                "новый/старый \n" +
                "Поведение : \n" +
                "открывать дверь \n" +
                "закрывать дверь");
        System.out.println();
        System.out.println("6 - Кастрюля \n" +
                "Состояние : \n" +
                "новая/старая \n" +
                "чистая/грязная \n" +
                "материал \n" +
                "Поведение \n" +
                "готовить \n" +
                "мыть");
        System.out.printf("7 - Зубная паста \nСостояние \nколичества пасты \nПоведение : \nоткрыть \nвыдавить на щетку \nзакрыть%n");
        System.out.println();
        System.out.println("8 - Копилка \n" +
                "Состояние \n" +
                "количества монет в копилке \n" +
                "Поведение \n" +
                "положить монету в копилку \n" +
                "достать монеты(если копилка переполнена )");
        System.out.println();
        System.out.println("9 - Утюг \n" +
                "Состояние \n" +
                "вкл/выкл \n" +
                "режим нагрева \n" +
                "Поведение: \n" +
                "при включении и выборе режима устанавливается определенная тем-ра \n" +
                "при выкл.темп-ра уменьшается");
        System.out.println();
        System.out.println("10 - Часы\n" +
                "Состояние \n" +
                "работают/не работают \n" +
                "Поведение: \n" +
                "если работают-стрелки движаться \n" +
                "если не работают-стоят на месте");


    }

}