package by.jrr;

public class Algoritms {
    public static void main(String[] args) {
        System.out.println("1\tВынести мусор\t\n" +
                "\t\tзайти на кухню\n" +
                "\t\tоткрыть мусорное ведро\n" +
                "\t\tвынуть пакет с мусором\n" +
                "\t\tзавязать пакет на узел\n" +
                "\t\tвзять пакет в руки\n" +
                "\t\tс пакетом в руках выйти из дома\n" +
                "\t\tс пакетом в руках подойти к мусорному контейнеру\n" +
                "\t\tвыкинуть пакет с мусором\n");

        System.out.println("2\tЗаавести авто\t\n" +
                "\t\tподойти к авто\n" +
                "\t\tдостать из кармана ключ с пультом\n" +
                "\t\tнажать на кнопку пульта(чтобы снять авто с сигнаизации и открыть центральный замок)\n" +
                "\t\tоткрыть водительскую дверь\n" +
                "\t\tсесть в авто на место водителя\n" +
                "\t\tвставить ключ в замок зажигания\n" +
                "\t\tесли авто стоит на Pпаркинге или Nнейтрали - повернуть ключ в замке зажигания до срабатывания стартера\n" +
                "\t\tпоставить селектор в позицию Pпаркинг или Nнейтраль\n");
        System.out.println("3\tпосмотреть фильм по компу\t\n" +
                "\t\tвключить комп (нажатием кнопки Power)\n" +
                "\t\tВ диалоговом окне ввести пароль\n" +
                "\t\tоткрыть приложение ГуглХром (кликнуть на соответствующую иконку на рабочем столе)\n" +
                "\t\tв командной строке ввсести наименование желаемого фильма+смотреть онлайн\n" +
                "\t\tОткрыть провереную ссылку (кликнуть по ссылке  знакомого сайта из предложенной выборки)\n" +
                "\t\tнажать кнопку PLAY\n" +
                "\t\tНажать на кнопку \"Во весь экран\"\n");
        System.out.println("4\tнадеть костюм\t\n" +
                "\t\tдостать вешалку с костюмом из шкафа\n" +
                "\t\tснять с вешалки чехол\n" +
                "\t\tснять с вешалки брюки\n" +
                "\t\tнадеть на себя брюки - на ноги\n" +
                "\t\tСнять с вешалки рубаху\n" +
                "\t\tнадеть на себя рубаху - на корпус(туловище)\n" +
                "\t\tснять с вешалки пиджак\n" +
                "\t\tнадеть на себя пиджак - на  корпус (туловище)\n");
        System.out.println("5\tпринять душ\t\n" +
                "\t\tзайти в ванную комнату\n" +
                "\t\tснять с себя всю одежду\n" +
                "\t\tзайти в душевую кабинку\n" +
                "\t\tвключить воду нужной температуры - поворот рычажка от стены к центру\n" +
                "\t\tоблиться водой\n" +
                "\t\tвыйти из под струек воды\n" +
                "\t\tвзять в руки мыло\n" +
                "\t\tнамылиться\n" +
                "\t\tзайти под струйки воды\n" +
                "\t\tсмыть мыло с тела под струйками воды\n" +
                "\t\tвыключить воду - повернув рычажок от центра к стене\n" +
                "\t\tвыйти из душевой кабинки\n" +
                "\t\tвзять в руки банное полотенце\n" +
                "\t\tобтереться\n" +
                "\t\tповесить полотенце на сушку\n" +
                "\t\tодеться\n");
    }
}
