package by.jrr;

public class algorithm {

    public static void main(String[] args) {
        System.out.println("1.\tДоехать до работы\n" +
                "   1)\tСесть в машину\n" +
                "   2)\tЗавезти машину\n" +
                "   3)\tЕхать до работы соблюдая ПДД\n" +
                "   4)\tПрипарковать машину возле офиса\n" +
                "   5)\tЗаглушить машину\n");
        System.out.println("2.\tПожарить яйцо\n" +
                "   1)\tВключить плиту\n" +
                "   2)\tПоставить сковороду на плиту\n" +
                "   3)\tВзять яйцо\n" +
                "   4)\tПроверить нагрев сковороды, если не нагрелась то подождать\n" +
                "   5)\tСмазать сковороду маслом\n" +
                "   6)\tРазбить яйцо\n" +
                "   7)\tВылить содержимое яйца в сковороду\n" +
                "   8)\tПосолить\n" +
                "   9)\tДождаться готовности яйца\n" +
                "   10)\tСнять яйцо со сковороды\n" +
                "   11)\tВыключить плиту\n");
        System.out.println("3.\tЗабить гвоздь\n" +
                "   1)\tВзять молоток\n" +
                "   2)\tВзять гвоздь\n" +
                "   3)\tПриставить гвоздь к поверхности острым концом\n" +
                "   4)\tБить молотком по шляпке гвоздя пока он не войдет в поверхность полностью\n" +
                "   5)\tПри ударе по пальцам выматериться и в случае тяжелой травмы обратиться за помощью.\n");
        System.out.println("4.\tПокраска стены\n" +
                "   1)\tВзять краску\n" +
                "   2)\tВзять кисть\n" +
                "   3)\tМакнуть кисть в краску\n" +
                "   4)\tРазмазать краску по стене\n" +
                "   5)\tПовторять пункты 3 и 4 до тех пор, пока вся стена не будет одного цвета.\n");
        System.out.println("5.\tПомыться\n" +
                "   1)\tВключить душ\n" +
                "   2)\tНастроить комфортную температуру\n" +
                "   3)\tНамочить тело под водой из душа\n" +
                "   4)\tВзять мочалку\n" +
                "   5)\tНалить на мочалку гель для душа\n" +
                "   6)\tОбтереть мочалкой все тело\n" +
                "   7)\tПомыть шампунем волосы на голове\n" +
                "   8)\tСмыть пену с тела при помощи воды из душа\n" +
                "   9)\tВыключить душ\n" +
                "   10)\tВытереться полотенцем\n");
    }
}
