package by.jrr;

public class Objects {

    public static void main(String[] args) {
        System.out.println("1. Объект- Блокнот\n" +
                " Состояние: \n" +
                "    открытый/закрытый\n" +
                "    новый/исписанный\n" +
                "    количество страниц\n" +
                "    размер\n" +
                " Поведение:\n" +
                "    открыть \n" +
                "    закрыть\n" +
                "    листать\n" +
                "    писать ");
        System.out.println();
        System.out.println("2. Объект- Карандаш\n" +
                " Состояние:\n" +
                "    количество грифеля\n" +
                "    наличие ластика на конце\n" +
                "    цвет грифеля\n" +
                " Поведение:\n" +
                "    писать\n" +
                "    стирать\n" +
                "    точить");
        System.out.println();
        System.out.println("3. Объект- Газовая плита\n" +
                " Состояние:\n" +
                "    включенная\n" +
                "    выключенная\n" +
                "    температура\n" +
                " Поведение:\n" +
                "    включить (температура начинает повышаться)\n" +
                "    выключить (температура начинает снижаться)");
        System.out.println();
        System.out.println("4. Объект- Принтер\n" +
                " Состояние:\n" +
                "    включенный\n" +
                "    выключенный\n" +
                "    цвет чернил\n" +
                " Поведение:\n" +
                "    включить\n" +
                "    выключить\n" +
                "    печатать");
        System.out.println();
        System.out.println("5. Объект- Акварельные краски\n" +
                " Состояние:\n" +
                "    количество цветов\n" +
                "    количество красок\n" +
                "    твердая\n" +
                "    полутвердая\n" +
                "    пастообразная\n" +
                "    жидкая\n" +
                " Поведение:\n" +
                "    развести водой\n" +
                "    рисовать\n");
        System.out.println();
        System.out.println("6. Объект-Вилка\n" +
                " Состояние:\n" +
                "    чистая\n" +
                "    грязная\n" +
                " Поведение:\n" +
                "    мыть\n" +
                "    есть\n" +
                "    сервировать");
        System.out.println();
        System.out.println("7. Объект- Окно\n" +
                " Состояние:\n" +
                "    открытое\n" +
                "    закрытое\n" +
                "    чистое\n" +
                "    грязное\n" +
                "    материал рамы\n" +
                " Пведение:\n" +
                "    открыть\n" +
                "    закрыть\n" +
                "    мыть");
        System.out.println();
        System.out.println("8. Объект- Диван\n" +
                " Состояни:\n" +
                "    сложенный\n" +
                "    разложенный\n" +
                "    форма дивана\n" +
                " Поведение:\n" +
                "    разложить\n" +
                "    сложить");
        System.out.println();
        System.out.println("9. Объект- Зубная щетка\n" +
                " Состояние:\n" +
                "    новая/использованная\n" +
                "    уровень мягкости щетины\n" +
                "    материал шетины\n" +
                "    одноразовая/многоразовая\n" +
                "Поведение:\n" +
                "    чистить зубы\n" +
                "    мыть (используя это поведение щетка остается чистой)");
        System.out.println();
        System.out.println("10. Объект- Водная дверь\n" +
                "Состояние:\n" +
                "    открытая\n" +
                "    закрытая\n" +
                "    материал дери\n" +
                "Поведение:\n" +
                "    открыть\n" +
                "    закрыть");
    }
}
